SunCity/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/ШаблоныРегистрацииНовыхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ШаблоныРегистрацииНовыхКарт</name>
  <resources>
    <name>ПроводитьОпросВладельцаПриРегистрации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВидДисконтнойКарты</name>
    <type>
      <types>CatalogRef.ВидыДисконтныхКарт</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаКарты</name>
    <type>
      <types>CatalogRef.ИнформационныеКарты</types>
    </type>
  </resources>
  <resources>
    <name>НаименованиеШаблона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>БонуснаяПрограммаЛояльности</name>
    <type>
      <types>CatalogRef.БонусныеПрограммыЛояльности</types>
    </type>
  </resources>
  <resources>
    <name>ГруппаВладельцаКарты</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </resources>
  <dimensions>
    <name>ВидКарты</name>
    <type>
      <types>EnumRef.ВидыИнформационныхКарт</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДлинаКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НачалоДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>КонецДиапазона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>99</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

SunCity/src/Enums/ВидыИнформационныхКарт/ВидыИнформационныхКарт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыИнформационныхКарт</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Штриховая</name>
  </enumValues>
  <enumValues>
    <name>Магнитная</name>
  </enumValues>
  <enumValues>
    <name>Смешанная</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/InformationRegisters/ШаблоныРегистрацииНовыхКарт/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Проверяет на соответствие введенным шаблонам.
//
// Параметры:
//  КодКарты - Число - числовой или строковый код карты.
//  ВидКарты - Перечисление.ВидыИнформационныхКарт - вид карты.
//  МассивШаблонов - Массив - массив возвращаемых шаблонов.
//
// Возвращаемое значение:
//  Булево - результат проверки соответствия.
//
Функция РезультатПроверкиСоответствияШаблонам(КодКарты, ВидКарты, ТипШтрихкодаРТ, МассивШаблонов) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШаблоныКарт.ВидКарты,
	|	ШаблоныКарт.ПроводитьОпросВладельцаПриРегистрации,
	|	ШаблоныКарт.ДлинаКода,
	|	ШаблоныКарт.НачалоДиапазона КАК НачалоДиапазона,
	|	ШаблоныКарт.КонецДиапазона,
	|	ШаблоныКарт.ВидДисконтнойКарты,
	|	ШаблоныКарт.БонуснаяПрограммаЛояльности,
	|	ШаблоныКарт.ГруппаКарты,
	|	ШаблоныКарт.ГруппаВладельцаКарты,
	|	ШаблоныКарт.НаименованиеШаблона
	|ИЗ
	|	РегистрСведений.ШаблоныРегистрацииНовыхКарт КАК ШаблоныКарт
	|ГДЕ
	|	(ШаблоныКарт.ВидКарты = &ВидКарты
	|		ИЛИ ШаблоныКарт.ВидКарты = &СмешанныйВидКарты)
	|	И ШаблоныКарт.НачалоДиапазона <= &КодКарты
	|	И ШаблоныКарт.КонецДиапазона >= &КодКарты
	|	И ШаблоныКарт.ДлинаКода = &ДлинаКода
	|
	|УПОРЯДОЧИТЬ ПО
	|	НачалоДиапазона");
	
	Запрос.УстановитьПараметр("ВидКарты", ВидКарты);
	Запрос.УстановитьПараметр("СмешанныйВидКарты", Перечисления.ВидыИнформационныхКарт.Смешанная);
	Запрос.УстановитьПараметр("КодКарты", Строка(КодКарты));
	Запрос.УстановитьПараметр("ДлинаКода", СтрДлина(Строка(КодКарты)));
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		
		Возврат Ложь;
		
	Иначе	
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтруктураПараметров = ОбщегоНазначенияРТ.СтруктураПоСтрокеВыборки(Результат, Выборка);
			СтруктураПараметров.Вставить("КодКарты", КодКарты);
			СтруктураПараметров.Вставить("ТипШтрихкода", ТипШтрихкодаРТ);
			МассивШаблонов.Добавить(СтруктураПараметров);
		КонецЦикла;
		Возврат Истина;
		
	КонецЕсли;
	
КонецФункции 

#КонецОбласти

#КонецЕсли
